examples/using-data-from-csv/website-test.yml
config:
  target: http://asciiart.artillery.io:8080
  phases:
    - arrivalCount: 40
      duration: 20
  payload:
    - path: "./csv/urls.csv"
      fields:
        - url
  plugins:
    ensure:
      maxErrorRate: 0
    expect:
      reportFailuresAsErrors: true
      
scenarios:
  - flow:
      - loop:
        - get:
            url: "{{ url }}"
            expect:
              statusCode: 200
        - think: 1
        count: 5